# StairStringerCantOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairStringerCantOffset Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Inside stringer could not be created because of insufficient space. Please disable the inside stringer or decrease its width.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairStringerCantOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairStringerCantOffset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairStringerCantOffset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace